_out/ec2/webserver.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Web Server </title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Web Server </h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2809edd">Overview</a></li>
<li><a href="#org192e3b7">Prerequisets</a></li>
<li><a href="#org4fc3a71">Parameters</a>
<ul>
<li><a href="#orgcf65f37">DeploymentName</a></li>
<li><a href="#org5b4a9e3">KeyName</a></li>
<li><a href="#org984b62d">BuiltArtifactBucketName</a></li>
</ul>
</li>
<li><a href="#orgec4762c">Mappings</a></li>
<li><a href="#org4df41a2">Resources</a>
<ul>
<li><a href="#org5b4b383">IAM</a>
<ul>
<li><a href="#org5e535ad">Role</a></li>
<li><a href="#orgedd2571">Instance Profile</a></li>
</ul>
</li>
<li><a href="#org3a71b8f">Security Group</a></li>
<li><a href="#org6df8ba7">Instance</a></li>
</ul>
</li>
<li><a href="#org49701bd">Outputs</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org2809edd" class="outline-2">
<h2 id="org2809edd"><a href="#org2809edd">Overview</a></h2>
<div class="outline-text-2" id="text-org2809edd">
<p>
This CloudFormation template creates an EC2 instance running a web server.
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">AWSTemplateFormatVersion</span>: 2010-09-09
<span style="color: #dcaeea;">Description</span>: An EC2 Instance
</pre>
</div>
</div>
</div>

<div id="outline-container-org192e3b7" class="outline-2">
<h2 id="org192e3b7"><a href="#org192e3b7">Prerequisets</a></h2>
<div class="outline-text-2" id="text-org192e3b7">
<ul class="org-ul">
<li><a href="../network/public.html">../network/public.html</a> deployed with the same <code>DeploymentName</code></li>
<li>An EC2 KeyPair in this region</li>
</ul>
</div>
</div>

<div id="outline-container-org4fc3a71" class="outline-2">
<h2 id="org4fc3a71"><a href="#org4fc3a71">Parameters</a></h2>
<div class="outline-text-2" id="text-org4fc3a71">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Parameters</span>:
</pre>
</div>
</div>

<div id="outline-container-orgcf65f37" class="outline-3">
<h3 id="orgcf65f37"><a href="#orgcf65f37">DeploymentName</a></h3>
<div class="outline-text-3" id="text-orgcf65f37">
<p>
A <b>deployment</b> is a complete deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded term. Use the <code>DeploymentName</code> to indicate which deployment a Stack
is part of.
</p>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">DeploymentName</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: A name for this deployment
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b4a9e3" class="outline-3">
<h3 id="org5b4a9e3"><a href="#org5b4a9e3">KeyName</a></h3>
<div class="outline-text-3" id="text-org5b4a9e3">
<p>
AWS does not provide a CloudFormation type for EC2 KeyPairs. This was a
deliberate choice: a KeyPair consists of a public and private key, and AWS does
not want to expose the private key in CloudFormation outputs.
</p>

<p>
This is one example where Terraform has an advantage: since Terraform runs
locally, it can create a KeyPair and save the private key locally.
</p>

<p>
So, in CloudFormation, you have two options:
</p>

<ol class="org-ol">
<li>Create the KeyPair beforehand. Then provide the <code>KeyName</code> to your
CloudFormation template as a parameter.</li>
<li>Create the KeyPair using a CloudFormation Custom Resource (i.e. a Lambda
Function) in your CloudFormation template. The Custom Resource must save the
private key somewhere (like SecretsManager or SSM Parameter Store).</li>
</ol>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">KeyName</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::EC2::KeyPair::KeyName
    <span style="color: #dcaeea;">Description</span>: The name of an EC2 KeyPair
    <span style="color: #dcaeea;">Default</span>: test
</pre>
</div>
</div>
</div>

<div id="outline-container-org984b62d" class="outline-3">
<h3 id="org984b62d"><a href="#org984b62d">BuiltArtifactBucketName</a></h3>
<div class="outline-text-3" id="text-org984b62d">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">BuildArtifactBucketName</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: Name of the S3 bucket with build artifacts
    <span style="color: #dcaeea;">Default</span>: test-s3-bucket-bucket-1n9japign3xm7
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgec4762c" class="outline-2">
<h2 id="orgec4762c"><a href="#orgec4762c">Mappings</a></h2>
<div class="outline-text-2" id="text-orgec4762c">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Mappings</span>:
</pre>
</div>

<p>
Instance mapping
</p>

<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">RegionMap</span>:
    <span style="color: #dcaeea;">us-east-1</span>:
      <span style="color: #dcaeea;">AMI</span>: ami-0aeeebd8d2ab47354
    <span style="color: #dcaeea;">us-east-2</span>:
      <span style="color: #dcaeea;">AMI</span>: ami-0d8d212151031f51c
</pre>
</div>
</div>
</div>

<div id="outline-container-org4df41a2" class="outline-2">
<h2 id="org4df41a2"><a href="#org4df41a2">Resources</a></h2>
<div class="outline-text-2" id="text-org4df41a2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Resources</span>:
</pre>
</div>
</div>

<div id="outline-container-org5b4b383" class="outline-3">
<h3 id="org5b4b383"><a href="#org5b4b383">IAM</a></h3>
<div class="outline-text-3" id="text-org5b4b383">
<p>
The EC2 instance needs access to CloudWatch Logs and S3.
</p>
</div>

<div id="outline-container-org5e535ad" class="outline-4">
<h4 id="org5e535ad"><a href="#org5e535ad">Role</a></h4>
<div class="outline-text-4" id="text-org5e535ad">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">InstanceRole</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::Role
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">RoleName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-InstanceRole"</span>
      <span style="color: #dcaeea;">Description</span>: Allows EC2 instances to call AWS services
      <span style="color: #dcaeea;">AssumeRolePolicyDocument</span>:
        <span style="color: #dcaeea;">Version</span>: 2012-10-17
        <span style="color: #dcaeea;">Statement</span>:
          - <span style="color: #dcaeea;">Effect</span>: Allow
            <span style="color: #dcaeea;">Principal</span>:
              <span style="color: #dcaeea;">Service</span>: ec2.amazonaws.com
            <span style="color: #dcaeea;">Action</span>:
              - sts:AssumeRole
      <span style="color: #dcaeea;">Policies</span>:
        - <span style="color: #dcaeea;">PolicyName</span>: InstancePolicy
          <span style="color: #dcaeea;">PolicyDocument</span>:
            <span style="color: #dcaeea;">Version</span>: 2012-10-17
            <span style="color: #dcaeea;">Statement</span>:
              - <span style="color: #dcaeea;">Effect</span>: Allow
                <span style="color: #dcaeea;">Action</span>:
                  - logs:CreateLogGroup
                  - logs:CreateLogStream
                  - logs:PutLogEvents
                  - logs:DescribeLogStreams
                  - cloudformation:DescribeStackResource
                  - cloudformation:SignalResource
                <span style="color: #dcaeea;">Resource</span>: <span style="color: #98be65;">"*"</span>
              - <span style="color: #dcaeea;">Effect</span>: Allow
                <span style="color: #dcaeea;">Action</span>:
                  - s3:GetObject
                <span style="color: #dcaeea;">Resource</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"arn:aws:s3:::${BuildArtifactBucketName}/*"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgedd2571" class="outline-4">
<h4 id="orgedd2571"><a href="#orgedd2571">Instance Profile</a></h4>
<div class="outline-text-4" id="text-orgedd2571">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">InstanceProfile</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::InstanceProfile
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">InstanceProfileName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-InstanceProfile"</span>
      <span style="color: #dcaeea;">Roles</span>:
        - <span style="color: #ECBE7B;">!Ref</span> InstanceRole
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3a71b8f" class="outline-3">
<h3 id="org3a71b8f"><a href="#org3a71b8f">Security Group</a></h3>
<div class="outline-text-3" id="text-org3a71b8f">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">SecurityGroup</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::EC2::SecurityGroup
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">GroupDescription</span>: Allow HTTP and SSH
      <span style="color: #dcaeea;">GroupName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}"</span>
      <span style="color: #dcaeea;">VpcId</span>: {<span style="color: #dcaeea;">Fn::ImportValue</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-VpcId"</span>}
      <span style="color: #dcaeea;">SecurityGroupIngress</span>:
        - <span style="color: #dcaeea;">IpProtocol</span>: tcp
          <span style="color: #dcaeea;">FromPort</span>: 22
          <span style="color: #dcaeea;">ToPort</span>: 22
          <span style="color: #dcaeea;">CidrIp</span>: 0.0.0.0/32
      <span style="color: #dcaeea;">Tags</span>:
        - <span style="color: #dcaeea;">Key</span>: Name
          <span style="color: #dcaeea;">Value</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-instance"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6df8ba7" class="outline-3">
<h3 id="org6df8ba7"><a href="#org6df8ba7">Instance</a></h3>
<div class="outline-text-3" id="text-org6df8ba7">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">Instance</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::EC2::Instance
    <span style="color: #dcaeea;">Metadata</span>:
      <span style="color: #dcaeea;">AWS::CloudFormation::Authentication</span>:
        <span style="color: #dcaeea;">S3AccessCreds</span>:
          <span style="color: #dcaeea;">type</span>: S3
          <span style="color: #dcaeea;">buckets</span>:
            - <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${BuildArtifactBucketName}"</span>
          <span style="color: #dcaeea;">roleName</span>: <span style="color: #ECBE7B;">!Ref</span> InstanceRole
      <span style="color: #dcaeea;">AWS::CloudFormation::Init</span>:
        <span style="color: #dcaeea;">config</span>:
          <span style="color: #dcaeea;">files</span>:

            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Config file for cfn-hup</span>
            <span style="color: #dcaeea;">/etc/cfn/cfn-hup.conf</span>:
              <span style="color: #dcaeea;">content</span>: <span style="color: #ECBE7B;">!Sub</span> |
                <span style="color: #98be65;">[main]</span>
<span style="color: #98be65;">                stack=${AWS::StackName}</span>
<span style="color: #98be65;">                region=${AWS::Region}</span>
<span style="color: #98be65;">                verbose=true</span>
<span style="color: #98be65;">                interval=3</span>
              <span style="color: #dcaeea;">mode</span>: <span style="color: #98be65;">"000400"</span>
              <span style="color: #dcaeea;">owner</span>: root
              <span style="color: #dcaeea;">group</span>: root

            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Re-run cfn-init after every cloudformation update</span>
            <span style="color: #dcaeea;">/etc/cfn/hooks.d/cfn-auto-reloader.conf</span>:
              <span style="color: #dcaeea;">content</span>: <span style="color: #ECBE7B;">!Sub</span> |
                <span style="color: #98be65;">[cfn-auto-reloader-hook]</span>
<span style="color: #98be65;">                triggers=post.update</span>
<span style="color: #98be65;">                path=Resources.Instance.Metadata.AWS::CloudFormation::Init</span>
<span style="color: #98be65;">                action=/opt/aws/bin/cfn-init -v --stack ${AWS::StackName} --resource Instance --region ${AWS::Region}</span>
<span style="color: #98be65;">                runas=root</span>
              <span style="color: #dcaeea;">mode</span>: <span style="color: #98be65;">"000400"</span>
              <span style="color: #dcaeea;">owner</span>: root
              <span style="color: #dcaeea;">group</span>: root

            <span style="color: #5B6268;"># </span><span style="color: #5B6268;">TODO: Restart the web server after every cloudformation update</span>

            <span style="color: #dcaeea;">/home/ec2-user/go-webserver</span>:
              <span style="color: #dcaeea;">source</span>: https://test-s3-bucket-bucket-1n9japign3xm7.s3.us-east-2.amazonaws.com/main/go-webserver-amd64
              <span style="color: #dcaeea;">mode</span>: <span style="color: #98be65;">"000755"</span>
              <span style="color: #dcaeea;">owner</span>: root
              <span style="color: #dcaeea;">group</span>: root
              <span style="color: #dcaeea;">authentication</span>: S3AccessCreds
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">IamInstanceProfile</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-InstanceProfile"</span>
      <span style="color: #dcaeea;">ImageId</span>: <span style="color: #ECBE7B;">!FindInMap</span> [RegionMap, <span style="color: #ECBE7B;">!Ref</span> <span style="color: #98be65;">"AWS::Region"</span>, AMI]
      <span style="color: #dcaeea;">InstanceType</span>: t2.nano
      <span style="color: #dcaeea;">KeyName</span>: <span style="color: #ECBE7B;">!Ref</span> KeyName
      <span style="color: #dcaeea;">SecurityGroupIds</span>:
        - <span style="color: #ECBE7B;">!Ref</span> SecurityGroup
      <span style="color: #5B6268;"># </span><span style="color: #5B6268;">SsmAssociations:</span>
      <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">- SsmAssociation</span>
      <span style="color: #dcaeea;">SubnetId</span>: {<span style="color: #dcaeea;">Fn::ImportValue</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-PublicSubnet1"</span>}
      <span style="color: #dcaeea;">Tags</span>:
        - <span style="color: #dcaeea;">Key</span>: Name
          <span style="color: #dcaeea;">Value</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-instance"</span>
      <span style="color: #dcaeea;">UserData</span>:
        <span style="color: #dcaeea;">Fn::Base64</span>: <span style="color: #ECBE7B;">!Sub</span> |
          <span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/bin/bash</span>
<span style="color: #98be65;">          yum install -y aws-cfn-bootstrap</span>
          <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Run cfn-init which processes the AWS::CloudFormation::Init section</span>
<span style="color: #98be65;">          /opt/aws/bin/cfn-init -v --stack ${AWS::StackName} --resource Instance --region ${AWS::Region}</span>
          <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Start cfn-hup daemon, which checks Metadata every $interval and then</span>
          <span style="color: #5B6268;"># </span><span style="color: #5B6268;">performs actions in /etc/cfn/hooks.d/</span>
          <span style="color: #5B6268;">#</span>
          <span style="color: #5B6268;"># </span><span style="color: #5B6268;">TODO: Should this be a systemd service? See:</span>
          <span style="color: #5B6268;"># </span><span style="color: #5B6268;">https://aws.amazon.com/premiumsupport/knowledge-center/install-cloudformation-scripts/</span>
          /opt/aws/bin/cfn-hup || error_exit <span style="color: #98be65;">"Failed to start cfn-hup"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org49701bd" class="outline-2">
<h2 id="org49701bd"><a href="#org49701bd">Outputs</a></h2>
<div class="outline-text-2" id="text-org49701bd">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Outputs</span>:
  <span style="color: #dcaeea;">PublicIP</span>:
    <span style="color: #dcaeea;">Description</span>: Public IP of the EC2 instance
    <span style="color: #dcaeea;">Value</span>: <span style="color: #ECBE7B;">!GetAtt</span> Instance.PublicDnsName
    <span style="color: #dcaeea;">Export</span>:
      <span style="color: #dcaeea;">Name</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-PublicIP"</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
